gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x80f: file p1final.c, line 20.
(gdb) r
Starting program: /home/runner/Test3Session2-2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p1final.c:20
20  {
(gdb) n
22    input(&num1,&den1,&num2,&den2);
(gdb) n
enter the fraction number5
6
4
8
23    add(num1,den1,num2,den2,&num3,&den3);
(gdb) n
24    output(num1,den1,num2,den2,num3,den3);
(gdb) n
25    return 0;
(gdb) p num1
$1 = 5
(gdb) p num2
$2 = 4
(gdb) p num3
$3 = 64
(gdb) p den1
$4 = 6
(gdb) p den2
$5 = 8
(gdb) p den3
$6 = 48
(gdb) n
26    }(gdb) s
__libc_start_main (main=0x55a810800807 <main>, argc=1, argv=0x7ffdd57ddb08, 
    init=<optimized out>, fini=<optimized out>, rtld_fini=<optimized out>, 
    stack_end=0x7ffdd57ddaf8) at ../csu/libc-start.c:344
344 ../csu/libc-start.c: No such file or directory.
(gdb) n
addition of 5/6+4/8=64/48[Inferior 1 (process 1374) exited normally]
(gdb) q
îº§ 
